#!/bin/sh

# Syntax highlighting
zdharma-continuum/fast-syntax-highlighting

# Oh-my-zsh plugins
ohmyzsh/ohmyzsh path:lib/clipboard.zsh

# zsh-users/zsh-completions is a popular plugin for adding supplemental completions.
zsh-users/zsh-completions path:src kind:fpath
lukechilds/zsh-better-npm-completion kind:fpath

# Install custom prompt
romkatv/powerlevel10k kind:fpath

# Best util to use completions
belak/zsh-utils path:completion

# These core plugins should be loaded at the end
zsh-users/zsh-autosuggestions kind:defer
zsh-users/zsh-history-substring-search
