# Shared base — sourced by Brewfile##class.* via instance_eval

# Keep here just to make `brew bundle cleanup` work
brew "mas"
brew "yadm"
brew "mackup"

# GNU Core Utilities
brew "coreutils"
brew "binutils"
brew "findutils"
brew "moreutils"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "gnupg"
brew "gzip"
brew "bash"
brew "lsof"

# Essential CLI tools
brew "nvim"
brew "zsh"
brew "wget"
brew "openssh"
brew "openssl"
brew "xz"
brew "zlib"
brew "git"
brew "git-lfs"
brew "gh"
brew "tig"
brew "jq"
brew "fzf"

# Modern Unix tools
brew "eza"
brew "bat"
brew "tealdeer"
brew "ripgrep"
brew "fd"

# Development tools
brew "mise"
brew "scmpuff"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "colima"
brew "qemu"
brew "umputun/apps/revdiff"

# System utilities
brew "xdg-ninja"
brew "mole"

# Fonts
cask "font-fira-code-nerd-font"

# QuickLook plugins
cask "quicklook-json"
cask "qlmarkdown"
cask "quicklook-csv"

# Browsers
cask "google-chrome"
cask "firefox"
cask "microsoft-edge"

# Essential applications
cask "1password@7"
cask "obsidian"

# Development applications
cask "iterm2"
cask "visual-studio-code"
cask "zed"

# Productivity and UI enhancements
cask "sanesidebuttons"
cask "raycast"
cask "quitter"
cask "rescuetime"
cask "bartender"
cask "cleanshot"
cask "linearmouse"

# Communication tools
cask "zoom"

# Media
cask "vlc"

# Miscellaneous
cask "latest"
cask "chatgpt"
cask "claude"
cask "claude-code"

# Utility Apps from Mac App Store
mas "The Unarchiver", id: 425424353
mas "Paste", id: 967805235
mas "Velja", id: 1607635845
mas "Dato", id: 1470584107
mas "Lungo", id: 1263070803
mas "Shareful", id: 1522267256

# Productivity Suite from Mac App Store
mas "Keynote", id: 361285480
mas "Numbers", id: 361304891
mas "Pages", id: 361309726

# Communication and Social Media from Mac App Store
mas "Telegram", id: 747648890
mas "Slack", id: 803453959

# Security and Privacy from Mac App Store
