# Keep here just to make `brew bundle cleanup` work
brew "mas"
brew "yadm"
brew "mackup"

# GNU Core Utilities
brew "coreutils"
brew "binutils"
brew "findutils"
brew "moreutils"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "gnupg"
brew "gzip"
brew "bash"

# Essential CLI tools
brew "nvim"
brew "zsh"
brew "wget"
brew "openssh"
brew "openssl"
brew "xz"
brew "zlib"
brew "git"
brew "git-lfs"
brew "tig"
brew "jq"
brew "fzf"

# Modern Unix tools
brew "eza"
brew "bat"
brew "tealdeer"
brew "ripgrep"
brew "fd"

# Development tools
brew "mise"
brew "scmpuff"
brew "docker"
brew "docker-buildx"
brew "colima"
brew "qemu"
brew "aider"

# Job-specific tools
brew "sshuttle"
brew "zopfli"
brew "teleport"
brew "awscli"

# System utilities
brew "xdg-ninja"
brew "pcsc-lite"

# Fonts
cask "font-fira-code-nerd-font"

# QuickLook plugins
cask "quicklook-json"
cask "qlmarkdown"
cask "quicklook-csv"
cask "qlimagesize"

# Browsers
cask "google-chrome"
cask "firefox"
cask "microsoft-edge"

# Essential applications
cask "appcleaner"
cask "1password@7"
cask "obsidian"

# Development applications
cask "iterm2"
cask "visual-studio-code"
cask "zed"
cask "proxyman"

# Productivity and UI enhancements
cask "sensiblesidebuttons"
cask "raycast"
cask "quitter"
cask "rescuetime"
cask "bartender"
cask "cleanshot"

# Communication tools
cask "zoom"
cask "skype"

# Media applications
cask "spotify"
cask "vlc"

# Security
cask "avast-security"

# Job-specific applications
cask "pritunl"
cask "figma"

# Miscellaneous applications
cask "adobe-creative-cloud"
cask "airbuddy"
cask "imazing"
cask "transmission"
cask "qflipper"
cask "logitech-g-hub"
cask "calibre"
cask "outline-manager"
cask "latest"
cask "imaging-edge"
cask "chatgpt"

# Utility Apps from Mac App Store
mas "The Unarchiver", id: 425424353
mas "Paste", id: 967805235
mas "1Blocker", id: 1365531024
mas "DjVu Reader Pro", id: 895264364
mas "Velja", id: 1607635845
mas "Pandan", id: 1569600264
mas "Dato", id: 1470584107
mas "Parcel", id: 639968404
mas "Lungo", id: 1263070803
mas "Shareful", id: 1522267256

# Productivity Suite from Mac App Store
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# Communication and Social Media from Mac App Store
mas "Telegram", id: 747648890
mas "Slack", id: 803453959

# Information and News from Mac App Store
mas "Perplexity", id: 6714467650
mas "Reeder", id: 1529448980

# Entertainment from Mac App Store
mas "Shazam", id: 897118787

# Security and Privacy from Mac App Store
mas "Outline", id: 1356178125

# Task Management from Mac App Store
mas "Flow", id: 1423210932
