# Taps
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# Keep here just to make `brew bundle cleanup` work
brew "mas"
brew "yadm"
brew "mackup"

##
# GNU command line tools
#
# If you are moving onto macOS from GNU/Linux, then you would probably
# find out that the command line tools shipped with macOS are not as
# powerful and easy to use as the tools in Linux. The reason is that
# macOS uses the BSD version command line tools, which are different
# from the Linux version.
#
# Note: if you choose to replace the macOS commands with GNU commands,
# then be aware that you may have some compatibility issues with shell
# scripts written specifically for macOS.
#
# If you like using man pages, then you may also want to add an
# itemto the to the MANPATH environmental variable:
#
#     $HOMEBREW_PREFIX/opt/coreutils/libexec/gnuman
#
# For more about the GNU command line tools and brew, see this:
# https://www.topbug.net/blog/2013/04/14/install-and-use-gnu-command-line-tools-in-mac-os-x/
##

# Basic file, shell and text manipulation utilities of the GNU operating system.
brew "coreutils"
brew "binutils"
brew "findutils"
brew "moreutils"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "gnupg"
brew "gzip"
brew "bash"

# Essential CLI.
brew "vim"
brew "zsh"
brew "wget"
brew "openssh"
brew "openssl"
brew "xz"
brew "zlib"
# https://github.com/ibraheemdev/modern-unix
brew "eza"
brew "bat"
brew "tealdeer"

# Basic things for development.
brew "git"
brew "git-extras"
brew "git-lfs"
brew "tig"
brew "scmpuff"
brew "rtx"
brew "rust"
brew "podman"

# Misc CLI.
brew "youtube-dl"

# Only used at my current job.
brew "sshuttle"
brew "zopfli"
brew "teleport"
brew "awscli"

# Perfect fonts.
cask "font-fira-code"
cask "font-jetbrains-mono"

# Qquicklook addons.
cask "quicklook-json"
cask "qlmarkdown"
cask "quicklook-csv"
cask "qlimagesize"

# Browsers.
cask "brave-browser"
cask "google-chrome"
cask "firefox"
cask "microsoft-edge"

# Essential applications.
cask "appcleaner"
cask "1password7"
cask "yandex-disk"

# Basic applications for development.
cask "iterm2"
cask "visual-studio-code"
cask "proxyman"

# Improvements.
cask "raycast"
cask "quitter"
cask "rescuetime"
cask "bartender"
cask "cleanshot"

# Misc applications.
cask "airbuddy"
cask "transmission"
cask "qflipper"
cask "logitech-g-hub"
cask "calibre"
cask "raindropio"
cask "outline-manager"

# Communication.
cask "zoom"
cask "discord"

# Media.
cask "spotify"
cask "vlc"

# Only used at my current job.
cask "pritunl"
cask "figma"

# Installed from Mac App Store.
mas "The Unarchiver", id: 425424353
mas "Paste", id: 967805235
mas "1Blocker", id: 1365531024

mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

mas "Velja", id: 1607635845
mas "Pandan", id: 1569600264
mas "Reeder", id: 1529448980
mas "Shazam", id: 897118787
mas "Dato", id: 1470584107
mas "Parcel", id: 639968404
mas "Lungo", id: 1263070803
mas "Outline", id: 1356178125

mas "Slack", id: 803453959

mas "Bitdefender Virus Scanner", id: 500154009
